<script setup lang="ts">
const reviews = [{
    user: 'Александр',
    text: 'Очень понравился баланс-борд! Сделан качественно и удобно, в отличном деревянном кейсе. Оперативно изготовили и доставили. Покупкой доволен, всем рекомендую.',
}, {
    user: 'Евгения',
    text: 'Совсем недавно я стала счастливым обладателем такой штуковины - БАЛАНСБОРД. Первое, что хочу отметить - его оооочень приятно держать в руках, рассматривать, весь он такой идеально гладкий и ровный, изготовлен из прочной березовой фанеры и имеет красивый рисунок "под дерево". Но в руках держать его не надо - надо заниматься!\n' +
        'Второе - это действительно непросто!! Конечно, устоять, не падая в сторону, Вы сможете, но у борда широченные возможности для тренировки, на нем супер эффективный присед и подъемы ног (я освоила далеко не сразу).',
}, {
    user: 'Анна',
    text: 'Наша Тася давно мечтала о своей кухне, фартук и колпак были готовы, решили сделать подарок на день рождения. Спасибо Mokuton design ' +
        'за разработку дизайна и исполнение кухни для нашей юной хозяюшки! Она пришлась нам по душе, куклы теперь все сыты и довольны. ' +
        'Дочке 4 года, с удовольствием варит, жарит, запекает, устраивает чаепития ожидали, но и младшего братика (1,4 года) кухня тоже заинтересовала, наш юный исследователь шкафов и ящиков переместился с кухни реальной на кухню игрушечную и хлопает дверцами теперь исключительно там, и за сыпучие продукты на кухне можно больше не беспокоиться',
}, {
    user: 'Наталия',
    text: 'Спасибо за Дженга-акрабатов! Качественные, увлекательные ребята перед тем, как вручить подарок имениннику, проверили их сами',
}, {
    user: 'Анастасия',
    text: 'Вчера мне посчастливилось стать обладательницей потрясающей игры Дженга-Акробаты! Это шедевр!' +
        'Невероятно красивая коробочка, отличное качество и безумно затягивающий процесс.\n' +
        'Хотелось строить и строить. Вариантов очень много! Раздолье для фантазии.\n' +
        'Заинтересовало всех. И детей и взрослых! Повеселились от души!\n' +
        'Сделано из качественных натуральных материалов и с большой душой.' +
        'Я влюбилась в ваши работы. Обожаю подобные вещи... стильно, красиво и интересно.',
}];
</script>

<template>
    <div class="reviews__container pt-8 pb-8">
        <UCarousel
            v-slot="{ item }"
            :items="reviews"
            dots
            :ui="{item: 'basis-auto'}"
            class="w-full mx-auto"
        >
            <UCard class="m-2">
                <template #header>
                    <div class="flex gap-4 content-center">
                        <UAvatar icon="i-lucide-user"/>

                        <div class="text-bold">
                            {{ item.user }}
                        </div>
                    </div>
                </template>

                <div class="w-70">
                    {{ item.text }}
                </div>
            </UCard>
        </UCarousel>
    </div>
</template>

<style lang="scss" scoped>
.reviews {
    &__container {
        grid-column: 2;
    }

    &__item {
        height: calc(100vh - 20rem);
    }
}
</style>